#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-MPrMXqemqTVM8bhq

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.actions: Refreshing state... [id=agm-gcp9dahm4c-i57f4h-PUT]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_lambda_function.github: Refreshing state... [id=lambda-github]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy.lambda_invoke: Refreshing state... [id=iam_for_lambda:terraform-20210707172511482600000001]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=handler]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-i57f4h-PUT]
aws_api_gateway_deployment.this: Refreshing state... [id=n5up1c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.invoke_github will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invoke_github"  {
      ~ id      = "3874920128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_integration.lambda will be updated in-place
  ~ resource "aws_api_gateway_integration" "lambda" {
        id                      = "agi-gcp9dahm4c-oly2td-ANY"
      ~ uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:220881534007:function:handler/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_invoke will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_invoke" {
        id     = "iam_for_lambda:terraform-20210707172511482600000001"
        name   = "terraform-20210707172511482600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "lambda:InvokeAsync",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:220881534007:function:lambda-github"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2021-07-19T22:35:27.069+0000" -> (known after apply)
      ~ source_code_hash               = "xQPRT3hIyBYhWrFHaMYgR44iIws+HPm9Cno3y7e8GKg=" -> "kdqGx4TxZaqAAxWokgMCZixmhxi05wiOB4uOFBAgn+Y="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.app must be replaced
-/+ resource "aws_lambda_function" "app" {
      ~ arn                            = "arn:aws:lambda:ca-central-1:220881534007:function:handler" -> (known after apply)
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      ~ filename                       = "app.zip" -> "lambda-app.zip"
      ~ function_name                  = "handler" -> "lambda-app" # forces replacement
      ~ id                             = "handler" -> (known after apply)
      - image_uri                      = "" -> null
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:220881534007:function:handler/invocations" -> (known after apply)
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2021-07-19T22:35:41.046+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:220881534007:function:handler:$LATEST" -> (known after apply)
      ~ signing_job_arn                = "" -> (known after apply)
      ~ signing_profile_version_arn    = "" -> (known after apply)
      ~ source_code_hash               = "fjFsIDN4zdKTy+i3RlT9yPyVNL55bnO5J2b123TrOr8=" -> "uh49MNSUzR/bPbHexX6Der2RnHRdHI9WSCrSrZSI834="
      ~ source_code_size               = 5451380 -> (known after apply)
        tags                           = {
            "managed-by" = "terraform"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "LOCAL_DEV"                   = "false"
                # (16 unchanged elements hidden)
            }
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }

      ~ vpc_config {
          ~ vpc_id             = "vpc-018906cab60cf165b" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2021-07-19T22:35:34.226+0000" -> (known after apply)
      ~ source_code_hash               = "9hhoCPzthvYwkS3lKL+CyWu0Lz0ljft9DoWVoQosnB8=" -> "5viZGxrQgrioZIMz+dnrfUuxhAyESsMjHlKlHwC5+V4="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.github will be updated in-place
  ~ resource "aws_lambda_function" "github" {
        id                             = "lambda-github"
      ~ last_modified                  = "2021-07-19T22:35:48.041+0000" -> (known after apply)
      ~ source_code_hash               = "1h5BnJMni3RHhOFVzQKQj1xk57WpxYPK4LMzRa3Wyk8=" -> "A+He7ncB6Wv/F5mtcR6cOIioJjY6CVbdhLU0Rp/iDqs="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (17 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.apigw_auth must be replaced
-/+ resource "aws_lambda_permission" "apigw_auth" {
      ~ function_name = "handler" -> "lambda-app" # forces replacement
      ~ id            = "AllowAPIGatewayInvoke" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2021-07-19T22:18:35.232Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*